tap "anomalyco/tap", trusted: true # for OpenCode
tap "hashicorp/tap", trusted: true # for Terraform
tap "ngrok/ngrok", trusted: true
tap "zunit-zsh/zunit", trusted: true
tap "shivammathur/php", trusted: true
brew "actionlint"
brew "awscli"
cask "caffeine"
go "github.com/checkmake/checkmake/cmd/checkmake"
cask "claude-code"
brew "composer"
unless Dir.exist?("/Applications/Docker.app")
  cask "docker-desktop"
end
brew "editorconfig-checker"
unless Dir.exist?("/Applications/Elgato Control Center.app")
  cask "elgato-control-center"
end
cask "font-menlo-for-powerline"
unless Dir.exist?("/Applications/Ghostty.app")
  cask "ghostty"
end
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
brew "go"
unless Dir.exist?("/Applications/Google Chrome.app")
  cask "google-chrome"
end
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "inetutils"
brew "jq"
brew "markdownlint-cli2"
brew "mkcert"
brew "mysql@8.4", restart_service: true, link: true
cask "ngrok/ngrok/ngrok"
brew "anomalyco/tap/opencode"
brew "ollama"
go "mvdan.cc/sh/v3/cmd/shfmt"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "shivammathur/php/php@8.1"
brew "shivammathur/php/php@8.2"
brew "shivammathur/php/php@8.3"
brew "shivammathur/php/php@8.4"
brew "shivammathur/php/php@8.5"
brew "shivammathur/php/php@8.6"
brew "pyenv"
unless Dir.exist?("/Applications/Rectangle.app")
  cask "rectangle"
end
brew "saml2aws"
brew "shellcheck"
unless Dir.exist?("/Applications/Signal.app")
  cask "signal"
end
brew "sqlite"
unless Dir.exist?("/Applications/TimeScribe.app")
  cask "timescribe"
end
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "wget"
unless Dir.exist?("/Applications/WhatsApp.php")
  cask "whatsapp"
end
# Find security issues in GitHub Actions setups
brew "zizmor"
brew "zsh"
brew "zunit-zsh/zunit/zunit"
unless Dir.exist?("/Applications/1Password.app")
  cask "1password"
  cask "1password-cli"
end
