tap "hashicorp/tap"
tap "oven-sh/bun"
tap "shivammathur/php"
tap "universal-ctags/universal-ctags"
brew "actionlint"
brew "awscli"
brew "oven-sh/bun/bun"
cask "caffeine"
cask "claude-code"
cask "docker-desktop"
cask "elgato-control-center"
cask "font-menlo-for-powerline"
brew "git"
cask "google-chrome"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "inetutils"
cask "iterm2"
brew "jq"
brew "mysql@8.4"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "mkcert"
cask "ngrok/ngrok/ngrok"
brew "php@8.1"
brew "php@8.2"
brew "php@8.3"
brew "php@8.4"
brew "php"
brew "pnpm"
brew "pyenv"
cask "rectangle"
brew "saml2aws"
brew "shellcheck"
cask "signal"
brew "sqlite"
cask "timescribe"
brew "tmux"
brew "universal-ctags", args: ['HEAD']
brew "vim"
brew "wget"
cask "whatsapp"
brew "zsh"
cask "1password"
cask "1password-cli"
